In [1]:
#import lib
import pandas as pd
from pandas import ExcelWriter
from pandas import ExcelFile
import numpy as np
import openpyxl
import regex

In [2]:
#to create an excel file
df=pd.DataFrame({'Student ID':[1,2,3,4,5],'Name':['Anu','Sita','Ram','Pia','Mini'],'Marks':[76,87,56,83,68]})
writer =ExcelWriter('excel1.xlsx')
df.to_excel(writer,'Sheet1',index=False)
writer.save()

In [3]:
#python program for import data from excel file
df1=pd.read_csv("train_titanic.csv")

In [4]:
#checking data types
df1.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [5]:
#To format data in excel sheet
#conversion of object to string
df1['Ticket'] = df1['Ticket'].astype('string')

In [6]:
df1['Ticket']

0             A/5 21171
1              PC 17599
2      STON/O2. 3101282
3                113803
4                373450
             ...
886              211536
887              112053
888          W./C. 6607
889              111369
890              370376
Name: Ticket, Length: 891, dtype: string

In [7]:
#checking datatype
df1['Ticket'].dtype

string[python]

In [8]:
#Rounding to two decimal places
df1['Fare'] = np.round(df1['Fare'],decimals = 2)

In [9]:
df1['Fare']

0       7.25
1      71.28
2       7.92
3      53.10
4       8.05
       ...
886    13.00
887    30.00
888    23.45
889    30.00
890     7.75
Name: Fare, Length: 891, dtype: float64

In [10]:
#conversion of object to string
df1['Cabin'] =df1['Cabin'].astype('string')
df1['Name'] =df1['Name'].astype('string')
df1['Sex'] =df1['Sex'].astype('string')

In [11]:
df1.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            string
Sex             string
Age            float64
SibSp            int64
Parch            int64
Ticket          string
Fare           float64
Cabin           string
Embarked        object
dtype: object

In [12]:
df1['Cabin']

0      <NA>
1       C85
2      <NA>
3      C123
4      <NA>
       ...
886    <NA>
887     B42
888    <NA>
889    C148
890    <NA>
Name: Cabin, Length: 891, dtype: string

In [13]:
#searching any null value
df1.isnull().values.any()

True

In [14]:
#adding the null values
df1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [15]:
#replacing null values with NaN
df1 =df1.replace(' ',np.nan)

In [17]:
df1.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.90,<NA>,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.52,<NA>,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.50,<NA>,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.05,<NA>,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.12,<NA>,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,<NA>,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,<NA>,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,<NA>,Q

In [16]:
#filling of null values
df1.Age.fillna(value=df1.Age.mean(),inplace=True)

In [17]:
df1.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.000000,0,0,349257,7.90,<NA>,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.000000,0,0,7552,10.52,<NA>,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.000000,0,0,C.A./SOTON 34068,10.50,<NA>,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.000000,0,0,SOTON/OQ 392076,7.05,<NA>,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.000000,0,5,382652,29.12,<NA>,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.00,<NA>,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.45,<NA>,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.75,<NA>,Q

In [18]:
#Conversion of float to int
df1['Age']=df1['Age'].astype('int')

In [19]:
df1['Age']

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    29
889    26
890    32
Name: Age, Length: 891, dtype: int32

In [20]:
df1.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33,0,0,349257,7.90,<NA>,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22,0,0,7552,10.52,<NA>,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28,0,0,C.A./SOTON 34068,10.50,<NA>,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25,0,0,SOTON/OQ 392076,7.05,<NA>,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39,0,5,382652,29.12,<NA>,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.00,<NA>,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29,1,2,W./C. 6607,23.45,<NA>,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,<NA>,Q

In [21]:
#Filling null values
df1.Cabin.fillna(df1.Cabin.mode()[0],inplace=True)
df1.Embarked.fillna(df1.Embarked.mode()[0],inplace=True)

In [22]:
df1.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33,0,0,349257,7.90,B96 B98,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22,0,0,7552,10.52,B96 B98,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28,0,0,C.A./SOTON 34068,10.50,B96 B98,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25,0,0,SOTON/OQ 392076,7.05,B96 B98,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39,0,5,382652,29.12,B96 B98,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.00,B96 B98,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29,1,2,W./C. 6607,23.45,B96 B98,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,B96 B98,Q

In [23]:
#conversion of object to string
df1['Embarked'] =df1['Embarked'].astype('string')

In [24]:
df1.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            string
Sex             string
Age              int32
SibSp            int64
Parch            int64
Ticket          string
Fare           float64
Cabin           string
Embarked        string
dtype: object

In [25]:
#Rewritting dataframe to csv file
df1.to_csv("train_titanic2.csv", index=False)

In [26]:
# Defining file name and data
file_name = "chart2.xlsx"
file_data = (['Name', 'Marks'], ['Sam', 80], ['Samay', 90], ['Ram', 77], ['Shyam', 86])

In [27]:
#new workbook
xlsxfile = openpyxl.Workbook()
new_workbook = xlsxfile['Sheet']

In [28]:
#writing column names in workbook
for row, (Name,Marks) in enumerate(file_data, 1):
    new_workbook['A{}'.format(row)].value = Name
    new_workbook['B{}'.format(row)].value = Marks

In [30]:
#saving file
xlsxfile.save(file_name)

In [31]:
#loading file
excel_file_data = openpyxl.load_workbook(file_name)
excel_file_data.sheetnames

['Sheet']

In [32]:
# assign sheet values
sheet_values = excel_file_data['Sheet']

In [33]:
# to display contents
for row in sheet_values:
    for cell in row: 
        print(cell.value)

Name
Marks
Sam
80
Samay
90
Ram
77
Shyam
86

In [34]:
# importing packages for bar chart
from openpyxl.chart import BarChart, Reference
chart = BarChart()

In [35]:
# Filling chart title,X axis title and Y axis title
chart.title = "Students and Marks"
chart.y_axis.title = 'Marks'
chart.x_axis.title = 'Name'

In [36]:
#creating a reference to the data and appending the data to the chart.
data = Reference(sheet_values, min_row=2, max_row=5, min_col=1, max_col=2)
chart.add_data(data, from_rows=True, titles_from_data=True)

In [37]:
#Adding the chart to the sheet and saving the file.
new_workbook.add_chart(chart, "D2")
xlsxfile.save(file_name)

In [38]:
# To extract mobile no from PDF,XML and MS Word file and save into MS excel
# extract mobile no from python
%config IPCompleter.greedy=True
import docx

In [39]:
# open connection to Word Document
doc = docx.Document("Word_file.docx")

In [40]:
# fetching paragraphs from word document
all_paras = doc.paragraphs

In [41]:
for para in all_paras:
    print(para.text)

Aryan works in IT department. His date of joining is 12-02-2020. His phone number is 7890879087 .
Shyama works in HR department. Her date of joining is 12-02-2021. Her phone number is 7890123487 .
Shaan works in Finance department. His date of joining is 19-02-1999. His phone number is 9890879087 .
Ram works in Accounts department. His date of joining is 12-02-2022. His phone number is 7890882211 .
Abram works in Logistics department. His date of joining is 12-09-2020. His phone number is 8877879087 .
Kahani works in IT department. Her date of joining is 12-02-2018. Her phone number is 7890554487 .
Prem works in HR department. His date of joining is 12-05-2019. His phone number is 7866119087 .
Rita works in Marketing Departmant. Her date of joining is 20-06-2018. Her phone number is 8762451751 .

In [42]:
mobile_list1=[]
for index, para in enumerate(doc.paragraphs):
    if(para.text):
        mobileNo = regex.search('\d{10}',para.text,regex.UNICODE)
        if mobileNo:
             mobile_list1.append(mobileNo.group(0))
print("Mobile No Present in the Word File :",mobile_list1)

Mobile No Present in the Word File : ['7890879087', '7890123487', '9890879087', '7890882211', '8877879087', '7890554487', '7866119087', '8762451751']

In [43]:
# extract phone no from xml
from lxml import etree
doc = etree.parse('XMLFiles.xml')
mobile_list2=[ b.text for b in doc.iterfind('.//ContactNo') ]
print("Mobile no from XML file :",mobile_list2)

Mobile no from XML file : ['9876543210', '8976543211', '7656543211', '8766543211', '9876543201', '9876542211', '6876543211', '9876443211']

In [44]:
#extract phone no from pdf
import PyPDF2
import re

mobile_list3=[]
#for k in range(1,100):
# open the pdf file
object = PyPDF2.PdfFileReader("PDFfile.pdf")

# get number of pages
NumPages = object.getNumPages()

# extract text and do the search
for i in range(0, NumPages):
        PageObj = object.getPage(i)
        Text = PageObj.extractText() 
        ResSearch = re.search('\d{10}', Text)
        if ResSearch:
                mobile_list3.append(ResSearch.group(0))
print("Mobile No Present in the pdf File :",mobile_list3)

Mobile No Present in the pdf File : ['7890879087']

In [45]:
# storing the values of mobile numbers extracted from XML and word file
df5 = pd.DataFrame.from_dict({'Mobile Number From Word File':mobile_list1,'Mobile Number From XML File':mobile_list2})
df5.to_excel('Mobile No1.xlsx', header=True, index=False)